КР3/src/Documents/КорректировкаРейтинга/КорректировкаРейтинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаРейтинга</name>
  <registerRecords>InformationRegister.РейтингУчастников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Игрок</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейтинг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРейтинга</name>
      <type>
        <types>CatalogRef.ВидыРейтинга</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КР3/src/Documents/КорректировкаРейтинга/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КомандаПодбор(Команда)
	Данные = Новый Структура;
	Данные.Вставить("Соревнование", втДокОбъект);
	Данные.Вставить("Новый", Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодбора", ЭтотОбъект);
	ОткрытьФорму("Документ.ПроведениеСоревнования.Форма.ПодборУчастников", Данные, ЭтотОбъект,
		Новый УникальныйИдентификатор, , , ОписаниеОповещения, СерверныеСервер.ПолучитьРежимОткрытияФормыПодбора());
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбора(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Для Каждого ТекСтрока Из Результат Цикл
			НовСтрока = Объект.Данные.Добавить();
			НовСтрока.Игрок = ТекСтрока.Участник;
			НовСтрока.Рейтинг = ТекСтрока.Рейтинг;
		КонецЦикла;
		Если Объект.Данные.Количество() > 0 Тогда
			Модифицированность = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
